public class First {

    static void main() {

        // 프로그램을 위한 사전지식
        // 1. 하드웨어,소프트웨어,펌웨어

        // '하드웨어'
        // 물리적인 기계장치

        // '소프트웨어'
        // 하드웨어 상에서 돌아가는 프로그램

        // '펌웨어'
        // 하드웨어 장치의 기능을 제어하고 운영하는 역할
        
        // ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

        // 부제. 운영체제,응용프로그램

        // '운영체제'
        // 하드웨어와 소프트웨어를 연결해주는 다리역할
        // window,linux,unix등등
        
        // '응용프로그램'
        // 구체적인 작업을 할수있도록 도와주는 프로그램
        // excel,powerpoint등등
        
        
        //ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

        
        // 2. 기억장치

        // '주 기억장치'
        // ram

        // '보조 기억장치'
        // cd,usb,하드디스크,ssd 등
        
        /* 모든 프로그램은 주기억장치에서만 실행된다 */
        // 본인 컴퓨터에서 많은 프로그램을 실행했을때 램이 부족하면 렉이 걸릴때를 생각해보자


        //ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ


        /*
            3. 프로그래밍

            '시스템 프로그래밍'
            ex)os제작 및 수정

            '응용 프로그래밍'
            ex) 엑셀,한글,파워포인트 등등 여러가지

            '웹 프로그래밍'
            ex) 홈페이지 제작


        */

        // ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ
        
        /*
            4. 기본 용어

            '적재(load)' : 보조기억장치 -> 주기억장치
            '프로그램' : 보조기억장치(하드디스크,ssd)에 저장된 상태
            '프로세스' : 보조기억장치에서 주기억장치로 실행시켰을때 (주기억장치에 로드된 상태의 프로그램)
        
        
        */
        
        
        IO.println("\n첫번째 기록 : 하드웨어,소프트웨어,주기억장치,보조기억장치관련 기초내용들\n");
        

    }

}
